/*
*  constants
*
*/

export const columns = [
    {
     title: 'الفرع',
     dataIndex: "hub",
     key: 'hub',
     width:"200px"
     },
     {
     title: 'التاريخ',
     dataIndex: 'date',
     key: 'date',
     width:"200px"
     },
     {
     title: 'الوقت',
     dataIndex: 'time',
     key: 'time',
     width:"200px"
     },
     {
     title: 'التفاصيل',
     dataIndex: "state",
     key: 'state',
     width:"200px"
     },
 ]

export const TRANSLATED_API_TABLE_DATA=[
    {
      tracking_no:"6636234",
      delivery_address:"مصر الجديدة الكوربة بجوار مقهي سيلنترو ",
      tracking_details:[
        {
            "state": "تم إنشاء الشحنة",
            "date": "2018-07-05",
            "time": "11:03:52.342",
            "hub": "الفرع الرئيسي"
        },
        {
            "state": "تم استلام الشحنة",
            "date": "2018-07-05",
            "time": "20:03:09.22",
            "hub": "الفرع الرئيسي"
        },
        {
            "state": "لم يتم الشحن",
            "date": "2018-07-07",
            "time": "12:50:05.49",
            "hub": "الفرع الرئيسي"
        },
        {
            "state": "خرجت للتسليم",
            "date": "2018-07-07",
            "time": "12:50:05.49",
            "hub": "الفرع الرئيسي"
        },
        {
            "state": "استلام موقع الشحنة",
            "date": "2018-07-07",
            "time": "12:50:05.49",
            "hub": "الفرع الرئيسي"
        },
        {
            "state": "تم التسليم",
            "date": "2018-07-07",
            "time": "12:50:20.94",
            "hub": "الفرع الرئيسي"
        }
     ]
    },
    {
        tracking_no:"7234258",
        delivery_address:" حدائق الاهرام بوابة أ بجوار سمارت جيم",
        tracking_details:[
            {
                "state": "تم إنشاء الشحنة",
                "date": "2020-07-20",
                "time":"16:34"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-20",
                "time":"19:42",
                "hub": "فرع القطامية"
            },
            {
                "state": "الشحنة في الترانزيت",
                "date": "2020-07-20",
                "time":"20:42"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-20",
                "time":"20:35",
                "hub": "الفرع في القاهره"
            },
            {
                "state": "الشحنة في الترانزيت",
                "date": "2020-07-20",
                "time":"22:29"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-21",
                "time":"06:11",
                "hub": "فرع طنطا"
            },
            {
                "state": "لم يتم الشحن",
                "date": "2020-07-21",
                "time":"09:12"
            },
            {
                "state": "خرجت للتسليم",
                "date": "2020-07-21",
                "time":"09:12"
            },
            {
                "state": "في انتظار العميل",
                "date": "2020-07-21",
                "time":"09:12",
            },
            {
                "state": "استلام الشحنة",
                "date": "2020-07-21",
                "time":"09:12",
                "hub": "فرع طنطا"
            },
            {
                "state": "لم يتم الشحن",
                "date": "2020-07-25",
                "time":"10:35"
            },
            {
                "state": "خرجت للتسليم",
                "date": "2020-07-25",
                "time":"10:35"
            },
            {
                "state": "تم التسليم",
                "date": "2020-07-26",
                "time":"10:35"
            }
        ]
    },
    {
        tracking_no:"9442984",
        delivery_address:" امبابه شارع طلعت حرب بجوار مدينة العمال ",
        tracking_details:[
            {
                "state": "تم إنشاء الشحنة",
                "date": "2020-07-20",
                "time":"20:34"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-20",
                "time":"15:07",
                "hub": "فرع المهندسين"
            },
            {
                "state": "لم يتم الشحن",
                "date": "2020-07-21",
                "time":"08:08"
            },
            {
                
                "state": "خرجت للتسليم",
                "date": "2020-07-21",
                "time":"08:51"
               
            },
            {
                "state": "في انتظار العميل",
                "date": "2020-07-21",
                "time":"09:12",
            },
            {
                "state": "استلام الشحنة",
                "date": "2020-07-21",
                "time":"09:12",
                "hub": "فرع المهندسين"
            },
            {
                "state": "لم يتم الشحن",
                "date": "2020-07-21",
                "time":"15:54"
            },
            {
                "state": "خرجت للتسليم",
                "date": "2020-07-21",
                "time":"15:54"
            },
            {
             
                "state": "تم التسليم",
                "date": "2020-07-21",
                "time":"16:11"
                
            },
            {
                "state": "تم التسليم للمرسل",
                "date": "2020-07-21",
                "time":"20:11"
            }
        ]
    },
    {
        tracking_no:"1094442",
        delivery_address:" العبور الحي التاسع بجوار مول الياسمين ",
        tracking_details:
        [
            {
                "state": "تم إنشاء الشحنة",
                "date": "2020-07-21",
                "time":"22:34"
            },
            {

                "state": "تم استلام الشحنة",
                "date": "2020-07-21",
                "time":"19:07",
                "hub": "فرع الاسكندرية"
            },
            {
                "state": "الشحنة في الترانزيت",
                "date": "2020-07-21",
                "time":"22:29"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-21",
                "time":"22:12",
                "hub": "المخزن بالقاهرة"
            },
            {
                "state": "الشحنة في الترانزيت",
                "date": "2020-07-22",
                "time":"00:12"
            },
            {
                "state": "تم استلام الشحنة",
                "date": "2020-07-22",
                "time":"00:18",
                "hub": "فرع القطامية"
            },
            {
                "state": "لم يتم الشحن",
                "date": "2020-07-22",
                "time":"07:12",
            },
            {
                "state": "خرجت للتسليم",
                "date": "2020-07-22",
                "time":"07:22"
            },
            {
                "state": "تم التسليم",
                "date": "2020-07-22",
                "time":"13:35"
            }
        ]
    }
    
]